Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxSent_reg.h
/** \brief 66C, Interrupt Enable Register 21 */
#define SENT_CH21_INTEN /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000366Cu)
/** Alias (User Manual Name) for SENT_CH21_INTEN.
* To use register names with standard convension, please use SENT_CH21_INTEN.
*/
#define SENT_INTEN21 (SENT_CH21_INTEN)

/** \brief 670, Interrupt Node Pointer Register 21 */
#define SENT_CH21_INP /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003670u)
/** Alias (User Manual Name) for SENT_CH21_INP.
* To use register names with standard convension, please use SENT_CH21_INP.
*/
#define SENT_INP21 (SENT_CH21_INP)

/** \brief 674, Watch Dog Timer Register 21 */
#define SENT_CH21_WDT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF0003674u)
/** Alias (User Manual Name) for SENT_CH21_WDT.
* To use register names with standard convension, please use SENT_CH21_WDT.
*/
#define SENT_WDT21 (SENT_CH21_WDT)

/** \brief 680, Channel Pre Divider Register 22 */
#define SENT_CH22_CPDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003680u)
/** Alias (User Manual Name) for SENT_CH22_CPDR.
* To use register names with standard convension, please use SENT_CH22_CPDR.
*/
#define SENT_CPDR22 (SENT_CH22_CPDR)

/** \brief 684, Channel Fractional Divider Register 22 */
#define SENT_CH22_CFDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003684u)
/** Alias (User Manual Name) for SENT_CH22_CFDR.
* To use register names with standard convension, please use SENT_CH22_CFDR.
*/
#define SENT_CFDR22 (SENT_CH22_CFDR)

/** \brief 688, Receiver Control Register 22 */
#define SENT_CH22_RCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003688u)
/** Alias (User Manual Name) for SENT_CH22_RCR.
* To use register names with standard convension, please use SENT_CH22_RCR.
*/
#define SENT_RCR22 (SENT_CH22_RCR)

/** \brief 68C, Receive Status Register 22 */
#define SENT_CH22_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000368Cu)
/** Alias (User Manual Name) for SENT_CH22_RSR.
* To use register names with standard convension, please use SENT_CH22_RSR.
*/
#define SENT_RSR22 (SENT_CH22_RSR)

/** \brief 690, Serial Data and Status Register 22 */
#define SENT_CH22_SDS /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003690u)
/** Alias (User Manual Name) for SENT_CH22_SDS.
* To use register names with standard convension, please use SENT_CH22_SDS.
*/
#define SENT_SDS22 (SENT_CH22_SDS)

/** \brief 694, Input and Output Control Register 22 */
#define SENT_CH22_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003694u)
/** Alias (User Manual Name) for SENT_CH22_IOCR.
* To use register names with standard convension, please use SENT_CH22_IOCR.
*/
#define SENT_IOCR22 (SENT_CH22_IOCR)

/** \brief 698, SPC Control Register 22 */
#define SENT_CH22_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003698u)
/** Alias (User Manual Name) for SENT_CH22_SCR.
* To use register names with standard convension, please use SENT_CH22_SCR.
*/
#define SENT_SCR22 (SENT_CH22_SCR)

/** \brief 69C, Receive Data View Register 22 */
#define SENT_CH22_VIEW /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000369Cu)
/** Alias (User Manual Name) for SENT_CH22_VIEW.
* To use register names with standard convension, please use SENT_CH22_VIEW.
*/
#define SENT_VIEW22 (SENT_CH22_VIEW)

/** \brief 6A0, Interrupt Status Register 22 */
#define SENT_CH22_INTSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00036A0u)
/** Alias (User Manual Name) for SENT_CH22_INTSTAT.
* To use register names with standard convension, please use SENT_CH22_INTSTAT.
*/
#define SENT_INTSTAT22 (SENT_CH22_INTSTAT)

/** \brief 6A4, Interrupt Set Register 22 */
#define SENT_CH22_INTSET /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00036A4u)
/** Alias (User Manual Name) for SENT_CH22_INTSET.
* To use register names with standard convension, please use SENT_CH22_INTSET.
*/
#define SENT_INTSET22 (SENT_CH22_INTSET)

/** \brief 6A8, Interrupt Clear Register 22 */
#define SENT_CH22_INTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00036A8u)
/** Alias (User Manual Name) for SENT_CH22_INTCLR.
* To use register names with standard convension, please use SENT_CH22_INTCLR.
*/
#define SENT_INTCLR22 (SENT_CH22_INTCLR)

/** \brief 6AC, Interrupt Enable Register 22 */
#define SENT_CH22_INTEN /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00036ACu)
/** Alias (User Manual Name) for SENT_CH22_INTEN.
* To use register names with standard convension, please use SENT_CH22_INTEN.
*/
#define SENT_INTEN22 (SENT_CH22_INTEN)

/** \brief 6B0, Interrupt Node Pointer Register 22 */
#define SENT_CH22_INP /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00036B0u)
/** Alias (User Manual Name) for SENT_CH22_INP.
* To use register names with standard convension, please use SENT_CH22_INP.
*/
#define SENT_INP22 (SENT_CH22_INP)

/** \brief 6B4, Watch Dog Timer Register 22 */
#define SENT_CH22_WDT /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00036B4u)
/** Alias (User Manual Name) for SENT_CH22_WDT.
* To use register names with standard convension, please use SENT_CH22_WDT.
*/
#define SENT_WDT22 (SENT_CH22_WDT)

/** \brief 6C0, Channel Pre Divider Register 23 */
#define SENT_CH23_CPDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF00036C0u)
/** Alias (User Manual Name) for SENT_CH23_CPDR.
* To use register names with standard convension, please use SENT_CH23_CPDR.
*/
#define SENT_CPDR23 (SENT_CH23_CPDR)

/** \brief 6C4, Channel Fractional Divider Register 23 */
#define SENT_CH23_CFDR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF00036C4u)
/** Alias (User Manual Name) for SENT_CH23_CFDR.
* To use register names with standard convension, please use SENT_CH23_CFDR.
*/
#define SENT_CFDR23 (SENT_CH23_CFDR)

/** \brief 6C8, Receiver Control Register 23 */
#define SENT_CH23_RCR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF00036C8u)
/** Alias (User Manual Name) for SENT_CH23_RCR.
* To use register names with standard convension, please use SENT_CH23_RCR.
*/
#define SENT_RCR23 (SENT_CH23_RCR)

/** \brief 6CC, Receive Status Register 23 */
#define SENT_CH23_RSR /*lint --e(923, 9078)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF00036CCu)
/** Alias (User Manual Name) for SENT_CH23_RSR.
* To use register names with standard convension, please use SENT_CH23_RSR.
*/
#define SENT_RSR23 (SENT_CH23_RSR)

